Question-1

In [1]:
import pandas as pd

In [2]:
ds=pd.Series([4,8,15,16,23,42])

In [3]:
ds

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(ds)

pandas.core.series.Series

Question-2

In [17]:
li=[]
for i in range(1,11):
    li.append([i,i*i])
df=pd.DataFrame(li,columns=["roll","value"])
ds=pd.Series([i for i in range(10)])
df

   roll  value
0     1      1
1     2      4
2     3      9
3     4     16
4     5     25
5     6     36
6     7     49
7     8     64
8     9     81
9    10    100

In [15]:
df.head(2)

   roll  value
0     1      1
1     2      4

In [16]:
df.tail(3)

   roll  value
7     8     64
8     9     81
9    10    100

In [19]:
ds.head(2)

0    0
1    1
dtype: int64

In [20]:
ds[2]

2

Question-3

In [21]:
df=pd.DataFrame([["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]],columns=["Name","Age","Gender"])

In [22]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Question-4


In pandas, a DataFrame is a two-dimensional labeled data structure that can store data of different types (numeric, string, boolean, etc.) in a tabular form. It is one of the primary data structures in pandas and is similar to a table in a relational database or a spreadsheet in Excel. A DataFrame consists of rows and columns, where each column can have a different data type.

On the other hand, a pandas Series is a one-dimensional labeled array that can store data of a single data type. It is similar to a column in a DataFrame or a single column of data in a spreadsheet. A Series has an associated index, which provides labels for each element in the array.

The DataFrame provides a tabular structure where we can access and manipulate data in a row-wise or column-wise manner. It allows us to perform operations on the entire dataset, such as filtering rows, selecting specific columns, or applying mathematical operations across columns.

On the other hand, the Series represents a single column of data with its associated index. It is useful when we need to work with data in a one-dimensional manner or perform operations on a specific column.

In [23]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['John', 'Emma', 'Mike'],
        'Age': [25, 28, 32],
        'Country': ['USA', 'UK', 'Canada']}
df = pd.DataFrame(data)

# Creating a Series
ages = pd.Series([25, 28, 32], name='Age')

print("DataFrame:")
print(df)
print("\nSeries:")
print(ages)

DataFrame:
   Name  Age Country
0  John   25     USA
1  Emma   28      UK
2  Mike   32  Canada

Series:
0    25
1    28
2    32
Name: Age, dtype: int64

Question-5

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions you can use:

head() and tail(): These functions allow you to view the first few rows (head()) or last few rows (tail()) of a DataFrame. They are useful for quickly inspecting the data.

info(): This function provides a summary of the DataFrame, including the data types of each column, the number of non-null values, and memory usage. It helps in understanding the structure of the DataFrame and identifying any missing or inconsistent data.

describe(): It generates descriptive statistics of the numerical columns in the DataFrame, such as count, mean, standard deviation, minimum value, and quartile values. It gives an overview of the distribution and basic statistics of the data.

shape: It returns a tuple representing the dimensions of the DataFrame, i.e., the number of rows and columns. It's useful to quickly check the size of the DataFrame.

isnull() and notnull(): These functions return a Boolean DataFrame indicating missing values (isnull()) or non-missing values (notnull()) in the DataFrame. They help identify and handle missing data.

fillna(): This function is used to fill missing values in a DataFrame with a specified value or a calculated value (e.g., mean, median). It helps in handling missing data before analysis or modeling.

dropna(): It is used to drop rows or columns with missing values from the DataFrame. It helps in removing incomplete or irrelevant data from the analysis.

sort_values(): This function sorts the DataFrame by one or more columns in ascending or descending order. It is helpful for arranging data based on a specific criterion, such as sorting by date or sorting by a numerical column.

groupby(): It is used to group the data in the DataFrame based on one or more columns. It allows you to perform operations on grouped data, such as calculating aggregate statistics or applying custom functions.

merge() and concat(): These functions are used to combine multiple DataFrames based on common columns (merge()) or concatenate DataFrames along a particular axis (concat()). They are useful for combining data from different sources or splitting and reassembling data.

Question-6

Among the options mentioned, both Series and DataFrame in pandas are mutable in nature, while Panel is immutable.

Question-7

In [25]:
import pandas as pd

# Creating Series
names = pd.Series(['John', 'Emma', 'Mike'])
ages = pd.Series([25, 28, 32])
countries = pd.Series(['USA', 'UK', 'Canada'])

# Creating DataFrame using the Series
data = {'Name': names, 'Age': ages, 'Country': countries}
df = pd.DataFrame(data)

df

   Name  Age Country
0  John   25     USA
1  Emma   28      UK
2  Mike   32  Canada